In [1]:
import pandas as pd
import numpy as np

In [2]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010),
        ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 47389904,
              4488456, 39366586,
              1235753, 4873678]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    47389904
(New York, 2000)       4488456
(New York, 2010)      39366586
(Texas, 2000)          1235753
(Texas, 2010)          4873678
dtype: int64

In [3]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    47389904
(New York, 2000)       4488456
(New York, 2010)      39366586
(Texas, 2000)          1235753
dtype: int64

In [4]:
#potential slow and mugging way to select all values from 2010
#This method is not efficient for huge data sets
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    47389904
(New York, 2010)      39366586
(Texas, 2010)          4873678
dtype: int64

In [5]:
#The efficient way is to use Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [6]:
#re-indexing to see the hierarchical representation of the data
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
Texas       2000     1235753
            2010     4873678
dtype: int64

In [7]:
pop[:, 2010]

California    47389904
New York      39366586
Texas          4873678
dtype: int64

In [8]:
#convert a multiply index series into a conventionally indexed DF with unstack()
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  47389904
New York     4488456  39366586
Texas        1235753   4873678

In [9]:
#stack will provide the opposite operation
pop_df.stack()

California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
Texas       2000     1235753
            2010     4873678
dtype: int64

In [10]:
pop_df = pd.DataFrame({'total': pop,
                      'under18':[94584,84849,
                                84894, 75849,
                                83939, 97464]})
pop_df

                    total  under18
California 2000  33871648    94584
           2010  47389904    84849
New York   2000   4488456    84894
           2010  39366586    75849
Texas      2000   1235753    83939
           2010   4873678    97464

In [11]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.002792  0.001790
New York    0.018914  0.001927
Texas       0.067925  0.019998

In [12]:
#methods of multi index creation
#pass a list of two or more index arrays to the constructor
df = pd.DataFrame(np.random.rand(4,2),
                 index =[['a', 'a', 'b', 'b'], [1,2,1,2]],
                 columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.050635  0.114266
  2  0.426255  0.781620
b 1  0.925064  0.607291
  2  0.547176  0.732607

In [13]:
#pass a dictionary with appropriate tuples as keys
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [14]:
#explicit multi index constructors
pd.MultiIndex.from_arrays([['a', 'a','b','b'], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [15]:
#construct from tuples
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [16]:
#construct a cartesian product from single indices
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [17]:
#multi index level names
#With more involved datasets, this can be a useful way to keep track of the meaning of various index values.
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
Texas       2000     1235753
            2010     4873678
dtype: int64

In [18]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                                               names=['subject', 'type'])
#mock some data
data = np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

#Create the DF
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.2  15.0  36.3  29.0  38.6
     2      42.0  37.4  26.0  36.5  41.0  36.4
2014 1      34.0  34.6  34.0  37.4  24.0  35.7
     2      47.0  35.4  37.0  35.3  34.0  38.6

In [19]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      15.0  36.3
     2      26.0  36.5
2014 1      34.0  37.4
     2      37.0  35.3

In [20]:
#indexing and slicing a multiIndex
pop

state       year
California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
Texas       2000     1235753
            2010     4873678
dtype: int64

In [21]:
pop['California', 2000]

33871648

In [22]:
#partial indexing
pop['California']

year
2000    33871648
2010    47389904
dtype: int64

In [23]:
#partial slicing as long as the MultiIndex is sorted
pop.loc['California': 'New York']

state       year
California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
dtype: int64

In [24]:
pop[:, 2000]

state
California    33871648
New York       4488456
Texas          1235753
dtype: int64

In [25]:
#selection based on boolean masks
pop[pop> 22000000]

state       year
California  2000    33871648
            2010    47389904
New York    2010    39366586
dtype: int64

In [26]:
#selection based on fancy indexing 
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    47389904
Texas       2000     1235753
            2010     4873678
dtype: int64

In [27]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.2  15.0  36.3  29.0  38.6
     2      42.0  37.4  26.0  36.5  41.0  36.4
2014 1      34.0  34.6  34.0  37.4  24.0  35.7
     2      47.0  35.4  37.0  35.3  34.0  38.6

In [28]:
health_data['Guido', 'HR']

year  visit
2013  1        15.0
      2        26.0
2014  1        34.0
      2        37.0
Name: (Guido, HR), dtype: float64

In [29]:
#Also, as with the single-index case, we can use the loc, iloc, and ix indexers
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      47.0  37.2
     2      42.0  37.4

In [30]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        47.0
      2        42.0
2014  1        34.0
      2        47.0
Name: (Bob, HR), dtype: float64

In [31]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      47.0  15.0  29.0
2014 1      34.0  34.0  24.0

In [32]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.318388
      2      0.374752
c     1      0.128314
      2      0.232001
b     1      0.652300
      2      0.357171
dtype: float64

In [33]:
data = data.sort_index()
data

char  int
a     1      0.318388
      2      0.374752
b     1      0.652300
      2      0.357171
c     1      0.128314
      2      0.232001
dtype: float64

In [34]:
data['a': 'b']

char  int
a     1      0.318388
      2      0.374752
b     1      0.652300
      2      0.357171
dtype: float64

In [37]:
#stacking and unstacking indices
pop.unstack(level=0)

state  California  New York    Texas
year
2000     33871648   4488456  1235753
2010     47389904  39366586  4873678

In [38]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  47389904
New York     4488456  39366586
Texas        1235753   4873678

In [39]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    47389904
New York    2000     4488456
            2010    39366586
Texas       2000     1235753
            2010     4873678
dtype: int64

In [40]:
#index setting and resetting 
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    47389904
2    New York  2000     4488456
3    New York  2010    39366586
4       Texas  2000     1235753
5       Texas  2010     4873678

In [41]:
#reindexing while dealing with real world data sets
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    47389904
New York   2000     4488456
           2010    39366586
Texas      2000     1235753
           2010     4873678

In [42]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.2  15.0  36.3  29.0  38.6
     2      42.0  37.4  26.0  36.5  41.0  36.4
2014 1      34.0  34.6  34.0  37.4  24.0  35.7
     2      47.0  35.4  37.0  35.3  34.0  38.6

In [44]:
#finding mean average of the two year visits 
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     44.5  37.3  20.5  36.40  35.0  37.50
2014     40.5  35.0  35.5  36.35  29.0  37.15

In [45]:
#By further making use of the axis keyword, we can take the mean among levels on the columns as well
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  33.333333  37.066667
2014  35.000000  36.166667